БухЭксп/DataProcessors/CW_ПодборОперативныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>CW_ПодборОперативныхДокументов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыОперативнойЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыОперативнойЗадолженности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Кредиторская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дебиторская</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Documents/CW_Оплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_Оплата</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.CW_КурсовыеРазницы</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОперативнаяКредиторскаяЗадолженность</xr:Item>
				<xr:Item>AccumulationRegister.CW_ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОперативнаяДебиторскаяЗадолженность</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОплатаИсходящихСчетов</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОплатаВходящихСчетов</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОплатыПокупателейУСН</xr:Item>
				<xr:Item>InformationRegister.CW_ОплатаВходящихДокументов</xr:Item>
				<xr:Item>InformationRegister.CW_РаспределениеОплатПокупателейУСН</xr:Item>
				<xr:Item>InformationRegister.CW_ОплатаИсходящихДокументов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыОперативнойЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийПодборСчетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийПодборАктов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВозврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеДерева</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОтраженияАванса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокОтраженияАвансов</v8:Type>
						<v8:Type>cfg:CatalogRef.Патенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_Оплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Акт</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗадолженности</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетАванса</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оплата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оплата_БВ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Comment>НДС (в валюте оплаты)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/DataProcessors/CW_ПодборОперативныхДокументов/Ext/ManagerModule.bsl
Процедура ЗаполнитьДокументСписаниеСРасчетногоСчета(СтруктураПараметров, АдресРезультат) Экспорт
	
	Если ТипЗнч(СтруктураПараметров.ДокументВыписки) = Тип("ДокументСсылка.СписаниеСРасчетногоСчета") Тогда
		ВидЗадолженности = Перечисления.CW_ВидыОперативнойЗадолженности.Дебиторская;
	КонецЕсли;
	
 	Если ТипЗнч(СтруктураПараметров.ДокументВыписки) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
		ВидЗадолженности = Перечисления.CW_ВидыОперативнойЗадолженности.Кредиторская;
	КонецЕсли;   
	
	Если ВидЗадолженности = Неопределено Тогда
		ВызватьИсключение "не удалось определить вид задолженности!";
	КонецЕсли;

	СоответствиеСчетовАванса = ПолучитьСоответствиеСчетовАванса(ВидЗадолженности);
	
	СтруктураТаблиц = СтруктураПараметров.ПустыеТаблицыДокументов;  
	
	Отбор = Новый Структура("ИндексКартинки",  1); //Только строки второрго уровня
	НайденныеСтроки = СтруктураПараметров.ДереваСчетов.Строки.НайтиСтроки(Отбор, Истина); 
	
	Для Каждого ПодчиненаяСтрока из НайденныеСтроки Цикл
		
		Если ТипЗнч(ПодчиненаяСтрока.Сделка) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
			СчетАванса 			= СоответствиеСчетовАванса.Получить(ПодчиненаяСтрока.СчетЗадолженности); 
			Если СчетАванса = Неопределено Тогда
				СчетАванса = ПодчиненаяСтрока.СчетЗадолженности;
			КонецЕсли;
			СчетЗадолженности	= СчетАванса;
		Иначе     
			СчетЗадолженности 	= ПодчиненаяСтрока.СчетЗадолженности;
			СчетАванса 			= СоответствиеСчетовАванса.Получить(СчетЗадолженности); 
			Если СчетАванса = Неопределено Тогда
				СчетАванса = ПодчиненаяСтрока.СчетЗадолженности;
			КонецЕсли;  
		КонецЕсли;
		
		КурсВзаиморасчетов = ?(ПодчиненаяСтрока.СуммаВал = 0 , 1, ПодчиненаяСтрока.Сумма / ПодчиненаяСтрока.СуммаВал);  
		
		СтавкаЧислом 	= CW_Финансы.ПолучитьСтавкуНДС(ПодчиненаяСтрока.СтавкаНДС)/100;
		СуммаНДС 		= ПодчиненаяСтрока.Сумма  	* СтавкаЧислом / (1+СтавкаЧислом);
		СуммаНДСВал 	= ПодчиненаяСтрока.СуммаВал * СтавкаЧислом / (1+СтавкаЧислом);
		
		// - строка в документ "CW_Оплаты"
		НоваяСтрокаОплаты = СтруктураТаблиц.Оплаты.Добавить();
		НоваяСтрокаОплаты.Счет 	= ПодчиненаяСтрока.Родитель.ДокументВзаиморасчетов;
		НоваяСтрокаОплаты.Акт 	= ПодчиненаяСтрока.ДокументВзаиморасчетов; 
		
		НоваяСтрокаОплаты.СчетЗадолженности 	= ПодчиненаяСтрока.СчетЗадолженности; 
		НоваяСтрокаОплаты.СчетАванса 			= СчетАванса;  
		
		НоваяСтрокаОплаты.Оплата 		= ПодчиненаяСтрока.СуммаВал;
		НоваяСтрокаОплаты.Оплата_БВ 	= ПодчиненаяСтрока.Сумма;
		НоваяСтрокаОплаты.Курс 			= КурсВзаиморасчетов;
		НоваяСтрокаОплаты.СтавкаНДС 	= ПодчиненаяСтрока.СтавкаНДС;
		
		Если СтруктураПараметров.УчетныйДоговор.РасчетыВУсловныхЕдиницах Тогда
			СуммаПлатежа = ПодчиненаяСтрока.Сумма;
		Иначе
			СуммаПлатежа = ПодчиненаяСтрока.СуммаВал;
		КонецЕсли;

		// - строка в документ "Списание с расчетного счета" / "Поступление на расчетный счет"  
		НоваяСтрокаСписаниеСРасчетногоСчета = СтруктураТаблиц.ТаблицаБухгалтескогоДокумента.Добавить(); 
		НоваяСтрокаСписаниеСРасчетногоСчета.ДоговорКонтрагента 				= СтруктураПараметров.УчетныйДоговор;	
		НоваяСтрокаСписаниеСРасчетногоСчета.СпособПогашенияЗадолженности 	= Перечисления.СпособыПогашенияЗадолженности.ПоДокументу;	
		НоваяСтрокаСписаниеСРасчетногоСчета.Сделка 							= ПодчиненаяСтрока.Сделка;	
		НоваяСтрокаСписаниеСРасчетногоСчета.СуммаПлатежа 					= СуммаПлатежа;	
		НоваяСтрокаСписаниеСРасчетногоСчета.КурсВзаиморасчетов 				= КурсВзаиморасчетов;	
		НоваяСтрокаСписаниеСРасчетногоСчета.КратностьВзаиморасчетов 		= 1;	
		НоваяСтрокаСписаниеСРасчетногоСчета.СуммаВзаиморасчетов 			= ПодчиненаяСтрока.СуммаВал;	
		НоваяСтрокаСписаниеСРасчетногоСчета.СтавкаНДС 						= ПодчиненаяСтрока.СтавкаНДС;	
		НоваяСтрокаСписаниеСРасчетногоСчета.СуммаНДС 						= СуммаНДСВал;	
		НоваяСтрокаСписаниеСРасчетногоСчета.СтатьяДвиженияДенежныхСредств 	= СтруктураПараметров.СтатьяДвиженияДенежныхСредств;	
		НоваяСтрокаСписаниеСРасчетногоСчета.СчетУчетаРасчетовСКонтрагентом 	= СчетЗадолженности;	
		НоваяСтрокаСписаниеСРасчетногоСчета.СчетУчетаРасчетовПоАвансам 		= СчетАванса;	
		
	КонецЦикла;   
	
	
	//Заполняем документы
	ДокументОплата = СтруктураПараметров.ДокументОплата;  
	Если ДокументОплата <> Неопределено Тогда
		ДокументОплатаОбъект = ДокументОплата.ПолучитьОбъект(); 
		Если ДокументОплатаОбъект.ПометкаУдаления Тогда
			ДокументОплатаОбъект.УстановитьПометкуУдаления(Ложь);
		КонецЕсли;
	Иначе
		ДокументОплатаОбъект = Документы.CW_Оплата.СоздатьДокумент();  
		ДокументОплатаОбъект.Дата 					= СтруктураПараметров.ДатаДокумента;
		ДокументОплатаОбъект.Организация 			= СтруктураПараметров.Организация;
		ДокументОплатаОбъект.Контрагент 			= СтруктураПараметров.Контрагент;
		ДокументОплатаОбъект.Договор 				= СтруктураПараметров.Договор;
		ДокументОплатаОбъект.ПриложениеКДоговору 	= СтруктураПараметров.ПриложениеКДоговору;
		ДокументОплатаОбъект.Валюта 				= СтруктураПараметров.Договор.ВалютаДоговора;
		ДокументОплатаОбъект.Основание 				= СтруктураПараметров.ДокументВыписки;
		ДокументОплатаОбъект.ВидЗадолженности 		= ВидЗадолженности;       
	КонецЕсли; 
	
	ДокументОплатаОбъект.СтатьяДвиженияДенежныхСредств 	= СтруктураПараметров.СтатьяДвиженияДенежныхСредств;      
	ДокументОплатаОбъект.ЭтоВозврат						= Истина;      
	ДокументОплатаОбъект.ХранилищеДерева 				= Новый ХранилищеЗначения(СтруктураПараметров.ДереваСчетов);
	
	ДокументОплатаОбъект.Оплата.Загрузить(СтруктураТаблиц.Оплаты);
	ДокументОплатаОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	ДокументВыписки = СтруктураПараметров.ДокументВыписки;  
	ДокументВыпискиОбъект = ДокументВыписки.ПолучитьОбъект(); 
	
	ДокументВыпискиОбъект.РасшифровкаПлатежа.Загрузить(СтруктураТаблиц.ТаблицаБухгалтескогоДокумента);

	ДокументВыпискиОбъект.СуммаДокумента = ДокументВыпискиОбъект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	ДокументВыпискиОбъект.Записать(РежимЗаписиДокумента.Запись);

КонецПроцедуры 

Функция ПолучитьСоответствиеСчетовАванса(ВидЗадолженности) Экспорт
	
	ПланСчетов = ПланыСчетов.Хозрасчетный;
	
	Соответствие = Новый Соответствие;                   
	Если ВидЗадолженности = Перечисления.CW_ВидыОперативнойЗадолженности.Дебиторская Тогда
		Соответствие.Вставить(ПланСчетов.РасчетыСПокупателями,		ПланСчетов.РасчетыПоАвансамПолученным);	
		Соответствие.Вставить(ПланСчетов.РасчетыСПокупателямиВал,	ПланСчетов.РасчетыПоАвансамПолученнымВал);
		Соответствие.Вставить(ПланСчетов.РасчетыСПокупателямиУЕ ,   ПланСчетов.РасчетыПоАвансамПолученнымУЕ);	
	ИначеЕсли ВидЗадолженности = Перечисления.CW_ВидыОперативнойЗадолженности.Кредиторская Тогда
		Соответствие.Вставить(ПланСчетов.РасчетыСПоставщиками,		ПланСчетов.РасчетыПоАвансамВыданным);	
		Соответствие.Вставить(ПланСчетов.РасчетыСПоставщикамиВал,	ПланСчетов.РасчетыПоАвансамВыданнымВал);
		Соответствие.Вставить(ПланСчетов.РасчетыСПоставщикамиУЕ ,   ПланСчетов.РасчетыПоАвансамВыданнымУЕ);	
	КонецЕсли;
	
	Возврат Соответствие;

КонецФункции
